; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-6-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p2-1 - location
	p2-8 - location
	p3-0 - location
	p3-5 - location
	p3-6 - location
	p3-9 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	p5-8 - location
	p7-1 - location
	p7-2 - location
	p7-4 - location
	p8-6 - location
	p8-7 - location
	p9-2 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s6)
	(at driver3 s4)
	(at driver4 s8)
	(at driver5 s7)
	(at driver6 s4)
	(at driver7 s2)
	(at truck1 s8)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s8)
	(empty truck5)
	(at truck6 s9)
	(empty truck6)
	(at package1 s3)
	(at package2 s0)
	(at package3 s8)
	(at package4 s4)
	(at package5 s2)
	(at package6 s3)
	(at package7 s4)
	(at package8 s8)
	(at package9 s8)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s6)
	(link s6 s0)
	(link s0 s7)
	(link s7 s0)
	(link s0 s9)
	(link s9 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s7)
	(link s7 s1)
	(link s1 s8)
	(link s8 s1)
	(link s2 s9)
	(link s9 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s7)
	(link s7 s3)
	(link s3 s9)
	(link s9 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s8)
	(link s8 s4)
	(link s5 s1)
	(link s1 s5)
	(link s6 s9)
	(link s9 s6)
	(link s7 s5)
	(link s5 s7)
	(link s8 s2)
	(link s2 s8)
	(link s8 s3)
	(link s3 s8)
	(link s8 s6)
	(link s6 s8)
	(link s9 s4)
	(link s4 s9)
	(link s9 s8)
	(link s8 s9)
)
	(:goal (and
	(at driver1 s5)
	(at driver3 s3)
	(at driver4 s4)
	(at driver5 s8)
	(at driver6 s9)
	(at driver7 s8)
	(at truck3 s1)
	(at truck4 s6)
	(at truck5 s3)
	(at truck6 s8)
	(at package1 s6)
	(at package2 s4)
	(at package3 s9)
	(at package4 s2)
	(at package5 s0)
	(at package6 s2)
	(at package7 s7)
	(at package8 s0)
	(at package9 s8)
	))


)

; plan
1. (board-truck driver4 s8 truck1)
   deleted: (at driver4 s8) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 19
2. (board-truck driver7 s2 truck4)
   deleted: (at driver7 s2) (empty truck4)
   added: (driving driver7 truck4)
   goals met: 2 of 19
3. (drive-truck driver4 s8 s4 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   goals met: 2 of 19
4. (load-truck s4 package7 truck1)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 2 of 19
5. (load-truck s4 package4 truck1)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   goals met: 2 of 19
6. (drive-truck driver4 s4 s8 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s8)
   goals met: 2 of 19
7. (load-truck s8 package8 truck1)
   deleted: (at package8 s8)
   added: (in package8 truck1)
   goals met: 2 of 19
8. (load-truck s8 package3 truck1)
   deleted: (at package3 s8)
   added: (in package3 truck1)
   goals met: 2 of 19
9. (drive-truck driver4 s8 s3 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   goals met: 2 of 19
10. (drive-truck driver4 s3 s9 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   goals met: 2 of 19
11. (unload-truck s9 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s9)
   goals met: 3 of 19
12. (drive-truck driver7 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 3 of 19
13. (drive-truck driver7 s3 s8 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s8)
   goals met: 3 of 19
14. (drive-truck driver4 s9 s0 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s0)
   goals met: 3 of 19
15. (unload-truck s0 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 4 of 19
16. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 4 of 19
17. (load-truck s3 package6 truck1)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   goals met: 4 of 19
18. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 4 of 19
19. (unload-truck s2 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 5 of 19
20. (load-truck s2 package5 truck1)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 5 of 19
21. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 5 of 19
22. (unload-truck s0 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s0)
   goals met: 6 of 19
23. (load-truck s0 package2 truck1)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 6 of 19
24. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 6 of 19
25. (drive-truck driver4 s3 s9 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   goals met: 6 of 19
26. (drive-truck driver4 s9 s4 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   goals met: 6 of 19
27. (unload-truck s4 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 7 of 19
28. (walk driver3 s4 p5-4)
   deleted: (at driver3 s4)
   added: (at driver3 p5-4)
   goals met: 7 of 19
29. (walk driver3 p5-4 s5)
   deleted: (at driver3 p5-4)
   added: (at driver3 s5)
   goals met: 7 of 19
30. (walk driver3 s5 p3-5)
   deleted: (at driver3 s5)
   added: (at driver3 p3-5)
   goals met: 7 of 19
31. (walk driver3 p3-5 s3)
   deleted: (at driver3 p3-5)
   added: (at driver3 s3)
   goals met: 8 of 19
32. (walk driver5 s7 p8-7)
   deleted: (at driver5 s7)
   added: (at driver5 p8-7)
   goals met: 8 of 19
33. (walk driver5 p8-7 s8)
   deleted: (at driver5 p8-7)
   added: (at driver5 s8)
   goals met: 9 of 19
34. (board-truck driver5 s8 truck5)
   deleted: (at driver5 s8) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 8 of 19
35. (drive-truck driver5 s8 s3 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s3)
   goals met: 9 of 19
36. (load-truck s3 package1 truck5)
   deleted: (at package1 s3)
   added: (in package1 truck5)
   goals met: 9 of 19
37. (drive-truck driver5 s3 s8 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s8)
   goals met: 8 of 19
38. (board-truck driver1 s5 truck3)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 19
39. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 7 of 19
40. (drive-truck driver1 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 8 of 19
41. (disembark-truck driver1 s1 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 8 of 19
42. (walk driver1 s1 p5-1)
   deleted: (at driver1 s1)
   added: (at driver1 p5-1)
   goals met: 8 of 19
43. (walk driver1 p5-1 s5)
   deleted: (at driver1 p5-1)
   added: (at driver1 s5)
   goals met: 9 of 19
44. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 9 of 19
45. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 10 of 19
46. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 10 of 19
47. (drive-truck driver4 s3 s7 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   goals met: 10 of 19
48. (unload-truck s7 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s7)
   goals met: 11 of 19
49. (drive-truck driver4 s7 s1 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   goals met: 11 of 19
50. (drive-truck driver4 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 11 of 19
51. (disembark-truck driver4 s4 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s4) (empty truck1)
   goals met: 12 of 19
52. (board-truck driver6 s4 truck1)
   deleted: (at driver6 s4) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 12 of 19
53. (drive-truck driver6 s4 s9 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   goals met: 12 of 19
54. (disembark-truck driver7 s8 truck4)
   deleted: (driving driver7 truck4)
   added: (at driver7 s8) (empty truck4)
   goals met: 13 of 19
55. (disembark-truck driver5 s8 truck5)
   deleted: (driving driver5 truck5)
   added: (at driver5 s8) (empty truck5)
   goals met: 14 of 19
56. (board-truck driver7 s8 truck5)
   deleted: (at driver7 s8) (empty truck5)
   added: (driving driver7 truck5)
   goals met: 13 of 19
57. (drive-truck driver7 s8 s6 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s6)
   goals met: 13 of 19
58. (unload-truck s6 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s6)
   goals met: 14 of 19
59. (drive-truck driver7 s6 s9 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s9)
   goals met: 14 of 19
60. (disembark-truck driver7 s9 truck5)
   deleted: (driving driver7 truck5)
   added: (at driver7 s9) (empty truck5)
   goals met: 14 of 19
61. (disembark-truck driver6 s9 truck1)
   deleted: (driving driver6 truck1)
   added: (at driver6 s9) (empty truck1)
   goals met: 15 of 19
62. (board-truck driver7 s9 truck1)
   deleted: (at driver7 s9) (empty truck1)
   added: (driving driver7 truck1)
   goals met: 15 of 19
63. (drive-truck driver7 s9 s8 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   goals met: 15 of 19
64. (disembark-truck driver7 s8 truck1)
   deleted: (driving driver7 truck1)
   added: (at driver7 s8) (empty truck1)
   goals met: 16 of 19
65. (board-truck driver7 s8 truck4)
   deleted: (at driver7 s8) (empty truck4)
   added: (driving driver7 truck4)
   goals met: 15 of 19
66. (board-truck driver6 s9 truck5)
   deleted: (at driver6 s9) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 14 of 19
67. (drive-truck driver6 s9 s3 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s3)
   goals met: 15 of 19
68. (drive-truck driver7 s8 s9 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s9)
   goals met: 15 of 19
69. (disembark-truck driver7 s9 truck4)
   deleted: (driving driver7 truck4)
   added: (at driver7 s9) (empty truck4)
   goals met: 15 of 19
70. (board-truck driver7 s9 truck6)
   deleted: (at driver7 s9) (empty truck6)
   added: (driving driver7 truck6)
   goals met: 15 of 19
71. (drive-truck driver7 s9 s8 truck6)
   deleted: (at truck6 s9)
   added: (at truck6 s8)
   goals met: 16 of 19
72. (drive-truck driver6 s3 s9 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s9)
   goals met: 15 of 19
73. (disembark-truck driver6 s9 truck5)
   deleted: (driving driver6 truck5)
   added: (at driver6 s9) (empty truck5)
   goals met: 16 of 19
74. (disembark-truck driver7 s8 truck6)
   deleted: (driving driver7 truck6)
   added: (at driver7 s8) (empty truck6)
   goals met: 17 of 19
75. (board-truck driver6 s9 truck5)
   deleted: (at driver6 s9) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 16 of 19
76. (drive-truck driver6 s9 s3 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s3)
   goals met: 17 of 19
77. (walk driver3 s3 p3-9)
   deleted: (at driver3 s3)
   added: (at driver3 p3-9)
   goals met: 16 of 19
78. (walk driver3 p3-9 s9)
   deleted: (at driver3 p3-9)
   added: (at driver3 s9)
   goals met: 16 of 19
79. (board-truck driver3 s9 truck4)
   deleted: (at driver3 s9) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 16 of 19
80. (drive-truck driver3 s9 s6 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   goals met: 17 of 19
81. (drive-truck driver6 s3 s9 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s9)
   goals met: 16 of 19
82. (disembark-truck driver3 s6 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s6) (empty truck4)
   goals met: 16 of 19
83. (walk driver3 s6 p3-6)
   deleted: (at driver3 s6)
   added: (at driver3 p3-6)
   goals met: 16 of 19
84. (walk driver3 p3-6 s3)
   deleted: (at driver3 p3-6)
   added: (at driver3 s3)
   goals met: 17 of 19
85. (drive-truck driver6 s9 s3 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s3)
   goals met: 18 of 19
86. (disembark-truck driver6 s3 truck5)
   deleted: (driving driver6 truck5)
   added: (at driver6 s3) (empty truck5)
   goals met: 18 of 19
87. (walk driver6 s3 p3-9)
   deleted: (at driver6 s3)
   added: (at driver6 p3-9)
   goals met: 18 of 19
88. (walk driver6 p3-9 s9)
   deleted: (at driver6 p3-9)
   added: (at driver6 s9)
   goals met: 19 of 19
